# language: ru
Функция: проверка работоспособности кнопок на главной странице сайта БСПБ

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка           | страница         |
      | Частным клиентам | Частным клиентам |

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка  | страница |
      | Бизнесу | Бизнесу  |

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка | страница |
      | ВЭД    | ВЭД      |

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка           | страница         |
      | Финансовые рынки | Финансовые рынки |

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка          | страница        |
      | Private Banking | Private Banking |

  @success
  Структура сценария: при нажатии на кнопку "<кнопка>" открывается страница "<страница>"

    Дано пользователь находится на главной странице БСПБ
    Когда пользователь нажимает на кнопку "<кнопка>"
    Тогда открывается страница "<страница>"
    Примеры:
      | кнопка     | страница   |
      | Инвесторам | Инвесторам |